---
kind: property
id: P:Autodesk.Revit.DB.FamilyElementVisibility.IsShownInCoarse
source: html/533ac506-c5ba-5ea6-b7c5-447bc9c18655.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.IsShownInCoarse Property

Indicates if the instance is display with Coarse detail level in the view
of project document.

## Syntax (C#)
```csharp
public bool IsShownInCoarse { get; set; }
```

## Remarks
This property cannot be set to false if the other two detail levels are also false.